# 06 - Combining datasets

### Step 1. Import the necessary libraries

In [57]:
import pandas as pd 
import numpy as np

### Step 2. Import the datasets you'll find in the folder `data` and assign each to a variable called cars1 and cars2

The following exercise uses data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

In [58]:
cars1 = pd.read_csv("cars1.csv")
cars2 = pd.read_csv("cars2.csv")

### Step 3. Have a look at the columns of the dataset.

In [59]:
cars1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick,NaN,NaN,NaN,NaN,NaN
194,22.5,6,232,90,3085,17.6,76,1,amc hornet,NaN,NaN,NaN,NaN,NaN
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette,NaN,NaN,NaN,NaN,NaN
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody,NaN,NaN,NaN,NaN,NaN
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit,NaN,NaN,NaN,NaN,NaN

In [60]:
cars2

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [61]:
cars1.drop("Unnamed: 9", axis = 1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick,NaN,NaN,NaN,NaN
194,22.5,6,232,90,3085,17.6,76,1,amc hornet,NaN,NaN,NaN,NaN
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette,NaN,NaN,NaN,NaN
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody,NaN,NaN,NaN,NaN
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit,NaN,NaN,NaN,NaN

In [62]:
cars1.dropna(axis =1,inplace =True)
cars1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick
194,22.5,6,232,90,3085,17.6,76,1,amc hornet
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit

### Step 5. What is the number of observations in each dataset?

In [63]:
print("Number of observations cars1:", cars1.size)
print("Number of observations cars1:",cars2.size)

Number of observations cars1: 1782
Number of observations cars1: 1800

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [67]:
cars = cars1.append(cars2)
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [68]:
 serie = np.random.randint(15000,73000, 398)
 serie

array([30530, 50781, 55185, 21811, 35338, 43979, 63558, 50773, 16248,
       18747, 68702, 33051, 71569, 63823, 35140, 50814, 54592, 30760,
       69197, 60346, 62261, 41020, 18569, 67616, 32480, 41572, 62664,
       43473, 29314, 42380, 68022, 30636, 42067, 52303, 60688, 32153,
       36835, 16663, 45855, 37469, 65182, 50953, 67587, 67122, 36591,
       53199, 57057, 72633, 55931, 45045, 45804, 50809, 56561, 59035,
       15013, 53304, 37447, 18934, 36758, 60886, 19785, 38706, 35938,
       62958, 26955, 54679, 35582, 64584, 18393, 19044, 35252, 38595,
       36584, 38592, 26022, 59752, 20842, 19574, 45641, 19635, 72315,
       16262, 28001, 18327, 58049, 53223, 57413, 55501, 18739, 45823,
       21062, 65668, 32774, 25296, 18619, 55840, 42941, 65803, 36353,
       70724, 21490, 30518, 67334, 54077, 43700, 22552, 42791, 59612,
       24269, 72368, 24406, 48087, 67323, 39669, 58509, 49946, 39300,
       71814, 52762, 41658, 20177, 72942, 22804, 24393, 34693, 70394,
       72931, 58472, 19519, 52765, 62459, 27299, 55178, 17693, 23296,
       21353, 24965, 29252, 46636, 40256, 48870, 22148, 64300, 38308,
       63291, 31904, 31363, 71915, 21434, 70444, 43545, 38023, 25145,
       24173, 57069, 58047, 53185, 22914, 25648, 25173, 37147, 42511,
       32902, 58121, 66168, 36281, 67715, 55839, 61179, 52547, 66762,
       20944, 54804, 46469, 20145, 16314, 33135, 40756, 42497, 35604,
       26116, 18814, 61995, 18609, 60108, 72018, 20937, 33625, 72607,
       21913, 45820, 72884, 19635, 43601, 30998, 20213, 23140, 44498,
       24977, 64844, 34964, 32075, 68412, 53082, 23561, 72448, 25669,
       51812, 16924, 51335, 36277, 63758, 26962, 30982, 17220, 59082,
       33536, 29659, 61049, 62283, 42736, 20294, 64417, 49841, 50581,
       27128, 39114, 46915, 44377, 42555, 30660, 67135, 42995, 23005,
       65152, 65571, 54166, 42086, 28731, 54576, 23322, 55571, 64599,
       58378, 38181, 64771, 48848, 64801, 27360, 69633, 19036, 45299,
       30456, 64653, 48476, 37810, 22538, 31741, 52098, 61446, 41299,
       51432, 57960, 69207, 30019, 23876, 67834, 17686, 20403, 52543,
       54201, 16565, 38368, 43903, 34369, 45686, 28809, 39242, 69729,
       35258, 62452, 48500, 69300, 17874, 53705, 30230, 23890, 59341,
       41625, 60670, 40464, 43319, 18041, 60445, 51955, 47133, 45600,
       47583, 35322, 49968, 71274, 31381, 69231, 67662, 51760, 37786,
       71871, 26016, 52447, 17477, 17834, 47379, 20815, 21027, 17287,
       57737, 26373, 35078, 56110, 17561, 19973, 47370, 70561, 65279,
       49448, 60338, 65977, 42837, 38573, 63290, 48624, 45553, 46361,
       67506, 32858, 22884, 60897, 54200, 22435, 45711, 37416, 60310,
       38911, 61947, 20631, 54224, 66190, 24204, 34742, 70092, 47477,
       70750, 23234, 54547, 36561, 49589, 48606, 67782, 20565, 48593,
       19663, 53723, 48954, 66018, 31791, 61332, 50202, 18425, 30002,
       64008, 44443, 63935, 27770, 38077, 20390, 26057, 70708, 23162,
       27409, 39396, 16462, 52439, 65829, 15800, 50683, 48502, 69792,
       25348, 29759, 16983, 50884, 63149, 43024, 16750, 36333, 31964,
       72540, 40618])

### Step 8. Add the column owners to cars

In [69]:
cars["owners"] = serie
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,30530
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,50781
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,55185
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,21811
4,17.0,8,302,140,3449,10.5,70,1,ford torino,35338
...,...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,16750
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,36333
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,31964
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,72540
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,40618